package days11;

/**
 * @author 양인석
 * @date 2026. 5. 26. 오전 8:54:52
 * @subject 
 * @content
 */

public class Ex01 {

	public static void main(String[] args) {
		/*
		 * 1. 객체 지향 프로그램밍
		 * (Object Oriented Programming: OOP)
		 *  - 객체 + 객체 + ... 객체들을 만들고 -> 조립해서 -> 프로그래밍하는 기법.
		 * 2. 객체(Object): 물리적 존재 O + 개념적 존재 O 중 다른것과 식별가능한것.
		 * 3. 객체 = 속성(필드) + 동작(메소드)
		 *           특징       일, 기능
		 *           
		 *           
		 * 예) 
		 * 완성된 컴퓨터  = 부품 + 부품 + 부품+ .... 
		 *     소프트웨어 = 객체 + 객체 + 객체...   
		 * 
		 * 4. 객체(클래스) 간의 관계
		 *   1) 집합관계 : 자동차 객체   <-   엔진 객체 
		 *   2) 상속관계 : 객체 <- 필드, 메소드 - 객체
		 *   
		 * 5. OOP의 특징( == 클래스의 특징 )
		 *  1) 캡슐화
		 *    (은닉화)
		 *  2) 상속성
		 *  3) 다형성
		 *  4) 추상화
		 *  
		 * 6. 클래스 : 객체의 설계도
		 * 7. 인스턴스 : 클래스 -> 객체 생성한것 
		 *             인스턴스화( 객체를 생성하는 과정)
		 *             
		 *             
		 * 8. 클래스 선언
		 *    - 필드 + 메소드 선언         
		 *    - Sample.java 였다면 Sample 클래스명이 같아야한다.
		 *        접+기 합쳐서 modifiers(제한자)라고 한다        상속             다형성
		 *    - [접근지정자][기타제어자] class제어자 클래스명 [extends 부모클래스][implements 인터페이스...(...은 여러개 올수있다)]{
		 *    	    멤버(클래스 안에 있는 모든것) == 객체(클래스)의 구성 요소
		 *          1) 필드 ( ==변수), 속성(특징)
		 *          2) 메소드 (==함수), 동작(기능, 일)
		 *          3) 생성자
		 *          
		 *    }
		 * 
		 * 9. 객체 모델링(Object Modeling) : 현실 세계의 객체를 소프트웨어 객체로 설계하는 것(과정).
		 * 10. 클래스를 설계하는 과정
		 *   1) 객체의 구성요소( 속성, 동작) 파악 -> 목록 작성
		 *     스포츠카 : 운/조, 엔진 , 차체
		 *   2) 객체 모델링 - 필드, 메서드 작성
		 *   3) 클래스 선언
		 *   4) 객체 생성 - 테스트 
		 *   5) 문제점 파악 - 유지 보수
		 *   6) 상용화 
		 *   7) 기능추가, 또 문제점 파악 - 유지 보수, 버젼 관리
		 *   
		 *   
		 * 11. 신형 자동차 클래스 설계.
		 *    Car.java
		 *    
		 * 12. 필드는 초기화 하지 않아도 객체가 생성될 때
		 *       자료형의 기본값으로 초기화된다.
		 *       
		 * */
		

	}

}
